;; -*- no-byte-compile: t; -*-
;;; $DOOMDIR/packages.el

(unpin! apheleia)
(package! pinentry)
(package! preview-dvisvgm)
(package! rainbow-mode)
(package! catppuccin-theme)
(package! org-wild-notifier)
(package! org-super-agenda)
(package! org-modern)
(package! org-roam)
(package! org-roam-ui)
(package! org-ql)
(package! autothemer)
(package! org-noter)
(package! org-pdftools)
(package! org-noter-pdftools)
(package! org-appear)
(package! bibtex-completion)
(package! nov)
(package! org-ref)
(package! org-fragtog-mode
  :recipe (:host github :repo "io12/org-fragtog"))
(package! org-auto-tangle)
(package! citar)
(package! lsp-ui)
(package! citar-org-roam)
(package! aggressive-indent-mode)
(package! vertico-posframe)
(package! websocket)
(package! mixed-pitch)
(package! elfeed-score)
(package! olivetti)
(package! doct
  :recipe (:host github :repo "progfolio/doct"))
(package! org-modern-indent
  :recipe (:host github :repo "jdtsmith/org-modern-indent"))
(package! imenu-list)
(package! consult)
(package! tree-sitter)
(package! tree-sitter-langs)
